name: "diamante_llm"
platform: "onnxruntime_onnx"
max_batch_size: 8

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [1024]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [1024]
  }
]

output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [50257]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]
  }
]

optimization {
  execution_accelerators {
    gpu_execution_accelerator: [
      {
        name: "tensorrt"
        parameters { key: "precision_mode" value: "FP16" }
      }
    ]
  }
}
